0001DEFINE DATA LOCAL
00021 RH4N-GENERATE-JSON      (A) DYNAMIC const <'RHGENJS'>
00031 RH4N-GET-URL-VARIABLE   (A) DYNAMIC const <'RHGETUV'>
00041 RH4N-GET-BODY-VARIABLE  (A) DYNAMIC const <'RHGETBV'>
00051 RH4N-GET-BODY-OBJECT    (A) DYNAMIC const <'RHGETBO'>
0006END-DEFINE
