DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
1 input-grp
    2 testvar (A) DYNAMIC
    2 testvar1 (N5)
END-DEFINE
