DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
1 json-output
    2 msg (A20)
    2 msg-i (i4)
    2 cmd (A) DYNAMIC
END-DEFINE
