0001/** Program TEST-EMP.
0002/**
0003/** :author ziv
0004
0005 DEFINE DATA LOCAL
0006 1 CALLDATA
0007 2 #LOOPCOUNT (I4) INIT<10>
0008 2 #PERSID(A08) INIT <'50005000'>
0009 2 #FIRST-NAME (A20)
0010 2 #NAME (A20)
0011 2 #ZIP (A6)
0012 2 #CITY (A20)
0013 2 #COUNTRY (A03)
0014 2 #DEPT (A6)
0015 2 #AREA-CODE (A6)
0016 2 #PHONE (A15)
0017 2 #JOB-TITLE (A25)
0018 2 #MESSAGE (A40)
0019 END-DEFINE
0020
0021CALLNAT 'EMP-GET' CALLDATA
0022
0023WRITE 'Database response' /
0024  'Employee-Get for' #PERSID //
0025  'Firstname:' #FIRST-NAME /
0026  'Name:' #NAME /
0027  'Zip:' #ZIP /
0028  'City:' #CITY /
0029  'Country:' #COUNTRY /
0030  'Department:' #DEPT /
0031  'Phone:' #AREA-CODE #PHONE /
0032  'Jobtitle:' #JOB-TITLE //
0033  'Message:' #MESSAGE
0034
0035END
