* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program TEST.
/**
/** :author tom
/* TODO Enter your code here
write *datx *timx
END
