0001define data
0002    parameter
0003        1 http-req-type (A) DYNAMIC
0004        1 rh4n-internals (B) DYNAMIC
0005    local using testlda
0006end-define
0007
0008json-output.msg := 'Hello from the other side'
0009call interface4 'rhgenjs' rh4n-internals 'json-output@TESTLDA' json-output
0010
0011END
